<?php
/* --------------------------------------------------
		functions.php
		Blog Theme "L"
-------------------------------------------------- */

//---------------------------------------------------
//		アイキャッチ画像の有効化
//---------------------------------------------------

add_theme_support( 'post-thumbnails' );

//---------------------------------------------------
//		アイキャッチ画像でサイズ指定を無効化する
//---------------------------------------------------

add_filter( 'post_thumbnail_html', 'remove_thumbnail_dimensions', 10, 3 );
 
function remove_thumbnail_dimensions( $html, $post_id, $post_image_id ) {
    $html = preg_replace( '/(width|height)=\"\d*\"\s/', "", $html );
    return $html;
}

//---------------------------------------------------
//		管理バーをデフォルトで非表示にする（margin-top対策）
//---------------------------------------------------

add_filter('show_admin_bar', '__return_false')

?>